# ExportLinetypeKey Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLinetypeKey Constructor
ExportLinetypeKey Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportLinetypeKey()()()() | Constructs a new default ExportLinetypeKey. |
| ExportLinetypeKey(String) | Constructs a new default ExportLinetypeKey using the original line type name as input. |
| ExportLinetypeKey(ExportLinetypeKey) | Constructs a new copy of the input ExportLinetypeKey object. |

# See Also
ExportLinetypeKey Class
ExportLinetypeKey Members
Autodesk.Revit.DB Namespace